Hi Guys,<br>
Welcome back to the pandas essentials, now we are going to talk about the missing data!<br>
## Handling Missing Data
Missing data is very common in many data analysis applications. pandas has a great ability to deal with the missing data. <br>Let's learn some convenient methods to deal with **missing data in pandas**:<br>

* isnull(), isna(), notnull(), dropna(), fillna(),

In [ ]:
import numpy as np
import pandas as pd

Creating ad dataframe with missing data

In [ ]:
data_dic = {'M':[1,2,np.nan,4,np.nan],
            'N':[11,12,13,14,15],
            'O':[np.nan,np.nan,np.nan,np.nan,np.nan],
            'P':[16,np.nan,18,19,20]}
df = pd.DataFrame(data_dic) # dataframe from a dic.

In [ ]:
df

     M   N   O     P
0  1.0  11 NaN  16.0
1  2.0  12 NaN   NaN
2  NaN  13 NaN  18.0
3  4.0  14 NaN  19.0
4  NaN  15 NaN  20.0


**Check for missing data in the dataset!**

In [2]:
#code here
import numpy as np
import pandas as pd
data_dic = {'M':[1,2,np.nan,4,np.nan],
            'N':[11,12,13,14,15],
            'O':[np.nan,np.nan,np.nan,np.nan,np.nan],
            'P':[16,np.nan,18,19,20]}
df = pd.DataFrame(data_dic)
df = df.isna()
print(df)

       M      N     O      P
0  False  False  True  False
1  False  False  True   True
2   True  False  True  False
3  False  False  True  False
4   True  False  True  False

       M      N     O      P
0  False  False  True  False
1  False  False  True   True
2   True  False  True  False
3  False  False  True  False
4   True  False  True  False

In [3]:
#code here
import numpy as np
import pandas as pd
data_dic = {'M':[1,2,np.nan,4,np.nan],
            'N':[11,12,13,14,15],
            'O':[np.nan,np.nan,np.nan,np.nan,np.nan],
            'P':[16,np.nan,18,19,20]}
df = pd.DataFrame(data_dic)
sum = df.isna().sum()
print(sum)

M    2
N    0
O    5
P    1
dtype: int64

M    2
N    0
O    5
P    1
dtype: int64

In [6]:
#code here
import numpy as np
import pandas as pd
data_dic = {'M':[1,2,np.nan,4,np.nan],
            'N':[11,12,13,14,15],
            'O':[np.nan,np.nan,np.nan,np.nan,np.nan],
            'P':[16,np.nan,18,19,20]}
df = pd.DataFrame(data_dic)
print(df.isna().sum().sum())

8

8

**fill the null value with N**

In [7]:
#code here
import numpy as np
import pandas as pd
data_dic = {'M':[1,2,np.nan,4,np.nan],
            'N':[11,12,13,14,15],
            'O':[np.nan,np.nan,np.nan,np.nan,np.nan],
            'P':[16,np.nan,18,19,20]}
df = pd.DataFrame(data_dic)
df = df.fillna('N')
print(df)

     M   N  O     P
0  1.0  11  N  16.0
1  2.0  12  N     N
2    N  13  N  18.0
3  4.0  14  N  19.0
4    N  15  N  20.0

     M   N  O     P
0  1.0  11  N  16.0
1  2.0  12  N     N
2    N  13  N  18.0
3  4.0  14  N  19.0
4    N  15  N  20.0

**fill the null values using mean of the column M.**

In [11]:
#code here
import numpy as np
import pandas as pd
data_dic = {'M':[1,2,np.nan,4,np.nan],
            'N':[11,12,13,14,15],
            'O':[np.nan,np.nan,np.nan,np.nan,np.nan],
            'P':[16,np.nan,18,19,20]}
df = pd.DataFrame(data_dic)
df['M'] = df['M'].fillna(df['M'].mean())
print(df['M'])

0    1.000000
1    2.000000
2    2.333333
3    4.000000
4    2.333333
Name: M, dtype: float64

0    1.000000
1    2.000000
2    2.333333
3    4.000000
4    2.333333
Name: M, dtype: float64

In [13]:
import numpy as np
import pandas as pd
data_dic = {'M':[1,2,np.nan,4,np.nan],
            'N':[11,12,13,14,15],
            'O':[np.nan,np.nan,np.nan,np.nan,np.nan],
            'P':[16,np.nan,18,19,20]}
df = pd.DataFrame(data_dic)
df = df[['M', 'O', 'N', 'P']]
df.columns = ['A', 'B', 'C', 'D']
print(df)

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [ ]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

Forward fill

In [17]:
#code here
import numpy as np
import pandas as pd
data_dic = {'M':[1,2,np.nan,4,np.nan],
            'N':[11,12,13,14,15],
            'O':[np.nan,np.nan,np.nan,np.nan,np.nan],
            'P':[16,np.nan,18,19,20]}
df = pd.DataFrame(data_dic)
df_bfill = df.bfill()
print(df_bfill)

     M   N   O     P
0  1.0  11 NaN  16.0
1  2.0  12 NaN  18.0
2  4.0  13 NaN  18.0
3  4.0  14 NaN  19.0
4  NaN  15 NaN  20.0

     M   N   O     P
0  1.0  11 NaN  16.0
1  2.0  12 NaN  16.0
2  2.0  13 NaN  18.0
3  4.0  14 NaN  19.0
4  4.0  15 NaN  20.0

**Make this dataframe using Dictionary**

In [19]:
#code here
import numpy as np
import pandas as pd
data = {
    'key': ['a', 'b', 'c'],
    'A1': [0, 1, 2],
    'B1': [5, 6, 7],
    'A2': [0, 1, 2],
    'B2': [3, 4, 5]
}

df1 = pd.DataFrame(data)
print(df1)

  key  A1  B1  A2  B2
0   a   0   5   0   3
1   b   1   6   1   4
2   c   2   7   2   5

In [ ]:
df1

  key  A1  B1  A2  B2
0   a   0   5   0   3
1   b   1   6   1   4
2   c   2   7   2   5